[
    {
        "name": "Thorin",
        "description": "In the year TA 2746, Thorin II was born to Dwarven prince Thráin II in the mountain city of The Lonely Mountain. Early in his youth, he and the other Dwarves of the Lonely Mountain were forced to flee by the dragon Smaug in TA 2770. While in exile, he quickly grew to become a capable warrior. This was demonstrated when he participated in the Battle of Azanulbizar in TA 2799. He marched with one of the Dwarven armies beneath the East-gate of Moria. At some point in the fighting, his shield broke, and using an oaken tree branch found on the floor as a shield, he gained the epithet 'Oakenshield,' which would remain with him even in death.",
        "img_src": "https://vignette.wikia.nocookie.net/lotr/images/5/56/Young_Thorin.png/revision/latest/scale-to-width-down/200?cb=20130315124513",
        "url": "thorin"
    },
    {
        "name": "Kili and Fili",
        "description": "Fíli and Kíli were brothers, the youngest of the thirteen dwarves who set out on Thorin Oakenshield's quest along with Gandalf and Bilbo Baggins to reclaim the Lonely Mountain for the Dwarves. Fíli and Kíli were the two most active dwarves of Thorin's company, and apart from Balin, and possibly Bombur, they appeared more frequently as 'individual' characters in Tolkien's novel than the rest of Thorin's companions, who were most often named only in 'group' references to the entire company.",
        "img_src": "https://vignette.wikia.nocookie.net/lotr/images/b/b4/The-Hobbit-Fili-and-Kili.jpg/revision/latest/scale-to-width-down/350?cb=20110714202952",
        "url": "kili-fili"
    },
    {
        "name": "Oin",
        "description": "In Peter Jackson's The Hobbit film trilogy, Óin is portrayed by John Callen. Although hard of hearing and requiring an ear trumpet to aid him (which is later trodden on by one of the goblins in Goblin-town), Óin is as fierce a warrior as the other members of Thorin's party and is lethally proficient with his iron-headed staff (in one scene he is shown swinging it over his head multiple times, bashing numerous goblins at once).  According to the studio release, Along with his brother Glóin, Óin was a distant cousin of Thorin Oakenshield. A brave Northern Dwarf, Óin joins The Company of Thorin Oakenshield out of a sense of loyalty to his kin, and also because he has a substantial sum of money invested in the venture. Well read, with an inquiring mind, Óin was the healer among the Company, often applying an herbal salve of his own invention – which has since come to be known as 'ointment' after its maker.",
        "img_src": "https://vignette.wikia.nocookie.net/lotr/images/e/e8/Oin.jpg/revision/latest/scale-to-width-down/300?cb=20120908125247",
        "url": "oin"
    }
]